ZigaMahne/NXP_FRDM-MCXN947_BSP/boards/frdmmcxn947/cmsis/templates/Board/DualCore_TZ/cm33_core0/secure/MCUXpressoConfig/trustzone/resource_config.c
        enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable, attributes_index: '0',
        index: '4', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable,
        attributes_index: '0', index: '5', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable,
        attributes_index: '0', index: '6', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', shareability: non_shareable,
        attributes_index: '0', index: '7', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}]
- access_templates: {template: {id: NO_ACCESS, name: No access, locked: 'false', accesses: {ns_user: '000', ns_priv: '000', s_user: '000', s_priv: '000'}}, template: {
    id: R_s_priv, name: R for S-Priv, locked: 'false', accesses: {ns_user: '000', ns_priv: '000', s_user: '000', s_priv: '100'}}, template: {id: RW_s_priv, name: RW
      for S-Priv, locked: 'false', accesses: {ns_user: '000', ns_priv: '000', s_user: '000', s_priv: '110'}}, template: {id: RW_s_priv__R_s_user, name: 'RW for S-Priv,
      R for S-User', locked: 'false', accesses: {ns_user: '000', ns_priv: '000', s_user: '100', s_priv: '110'}}, template: {id: RW_s, name: RW for S, locked: 'false',
    accesses: {ns_user: '000', ns_priv: '000', s_user: '110', s_priv: '110'}}, template: {id: RW_s__R_ns, name: 'RW for S, R for NS', locked: 'false', accesses: {
      ns_user: '100', ns_priv: '100', s_user: '110', s_priv: '110'}}, template: {id: RW_s__RW_ns_priv, name: RW for S and NS-Priv, locked: 'false', accesses: {ns_user: '000',
      ns_priv: '110', s_user: '110', s_priv: '110'}}, template: {id: ALL, name: All, locked: 'false', accesses: {ns_user: '110', ns_priv: '110', s_user: '110', s_priv: '110'}}}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTEE
 * Description   : 
 *
 * END ****************************************************************************************************************/

/***********************************************************************************************************************
 * BOARD_InitTrustZone function
 **********************************************************************************************************************/
void BOARD_InitTrustZone()
{
    /* SAU configuration */
    
    /* Set SAU Control register: Disable SAU and All Secure */
    SAU->CTRL = 0;
    
    /* Force memory writes before continuing */
    __DSB();
    /* Flush and refill pipeline with updated permissions */
    __ISB();
    
    /* Set SAU Control register: Disable SAU and All Secure */
    SAU->CTRL = ((0U << SAU_CTRL_ALLNS_Pos) & SAU_CTRL_ALLNS_Msk)
        | ((0U << SAU_CTRL_ENABLE_Pos) & SAU_CTRL_ENABLE_Msk);
    
}

/***********************************************************************************************************************
 * BOARD_InitAHBSE function
 **********************************************************************************************************************/
void BOARD_InitAHBSE()
{
    /* AHB configuration */

    /*--------------------------------------------------------------------
     - AHB Security Level Configurations
     -------------------------------------------------------------------*/
    /* Configuration of AHB Secure Controller
       Possible values for every memory sector or peripheral rule:
        0    Non-secure, User access allowed.
        1    Non-secure, Privileged access allowed.
        2    Secure, User access allowed.
        3    Secure, Privileged access allowed.
    */

    /* Security level configuration of MPC checker */
    AHBSC->FLASH00_MEM_RULE[0] = 0x33333333U;
    AHBSC->FLASH00_MEM_RULE[1] = 0x33333333U;
    AHBSC->FLASH00_MEM_RULE[2] = 0x33333333U;
    AHBSC->FLASH00_MEM_RULE[3] = 0x33333333U;
    AHBSC->FLASH01_MEM_RULE[0] = 0x33333333U;
    AHBSC->FLASH01_MEM_RULE[1] = 0x33333333U;
    AHBSC->FLASH01_MEM_RULE[2] = 0x33333333U;
    AHBSC->FLASH01_MEM_RULE[3] = 0x33333333U;
    AHBSC->FLASH02_MEM_RULE = 0x00003333U;
    AHBSC->FLASH03_MEM_RULE = 0x00003333U;
    AHBSC->ROM_MEM_RULE[0] = 0x33333333U;
    AHBSC->ROM_MEM_RULE[1] = 0x33333333U;
    AHBSC->ROM_MEM_RULE[2] = 0x33333333U;
    AHBSC->ROM_MEM_RULE[3] = 0x33333333U;
    AHBSC->RAMX_MEM_RULE[0] = 0x33333333U;
    AHBSC->RAMX_MEM_RULE[1] = 0x33333333U;
    AHBSC->RAMX_MEM_RULE[2] = 0x33333333U;
    AHBSC->RAMA_MEM_RULE = 0x33333333U;
    AHBSC->RAMB_MEM_RULE = 0x33333333U;
    AHBSC->RAMC_MEM_RULE[0] = 0x33333333U;
    AHBSC->RAMC_MEM_RULE[1] = 0x33333333U;
    AHBSC->RAMD_MEM_RULE[0] = 0x33333333U;
    AHBSC->RAMD_MEM_RULE[1] = 0x33333333U;
    AHBSC->RAME_MEM_RULE[0] = 0x33333333U;
    AHBSC->RAME_MEM_RULE[1] = 0x33333333U;
    AHBSC->RAMF_MEM_RULE[0] = 0x33333333U;
    AHBSC->RAMF_MEM_RULE[1] = 0x33333333U;
    AHBSC->RAMG_MEM_RULE[0] = 0x33333333U;
    AHBSC->RAMG_MEM_RULE[1] = 0x33333333U;
    AHBSC->RAMH_MEM_RULE = 0x33333333U;
    AHBSC->FLEXSPI0_REGION0_MEM_RULE[0] = 0x33333333U;
    AHBSC->FLEXSPI0_REGION0_MEM_RULE[1] = 0x33333333U;
    AHBSC->FLEXSPI0_REGION0_MEM_RULE[2] = 0x33333333U;
    AHBSC->FLEXSPI0_REGION0_MEM_RULE[3] = 0x33333333U;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[0].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[1].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[2].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[3].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[4].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[5].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION7_MEM_RULE[0] = 0x33333333U;
    AHBSC->FLEXSPI0_REGION7_MEM_RULE[1] = 0x33333333U;
    AHBSC->FLEXSPI0_REGION7_MEM_RULE[2] = 0x33333333U;
    AHBSC->FLEXSPI0_REGION7_MEM_RULE[3] = 0x33333333U;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[0].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[1].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[2].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[3].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[4].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[5].FLEXSPI0_REGION_MEM_RULE0 = 0x00003333U;

    /* Security level configuration of PPC checker */
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE0 = 0x33333333U;
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE1 = 0x33333333U;
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE2 = 0x33333333U;
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE3 = 0x33333333U;
    AHBSC->APB_PERIPHERAL_GROUP1_MEM_RULE0 = 0x33333333U;
    AHBSC->APB_PERIPHERAL_GROUP1_MEM_RULE1 = 0x33333333U;
    AHBSC->APB_PERIPHERAL_GROUP1_MEM_RULE2 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE0 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE1 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE2 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE3 = 0x33333333U;
    AHBSC->AHB_PERIPHERAL0_SLAVE_PORT_P12_SLAVE_RULE0 = 0x33333333U;
    AHBSC->AHB_PERIPHERAL0_SLAVE_PORT_P12_SLAVE_RULE1 = 0x33333333U;
    AHBSC->AHB_PERIPHERAL0_SLAVE_PORT_P12_SLAVE_RULE2 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP1_MEM_RULE0 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP1_MEM_RULE1 = 0x33333333U;
    AHBSC->AHB_PERIPHERAL1_SLAVE_PORT_P13_SLAVE_RULE0 = 0x33333333U;
    AHBSC->AHB_PERIPHERAL1_SLAVE_PORT_P13_SLAVE_RULE1 = 0x33333333U;
    AHBSC->AHB_PERIPHERAL1_SLAVE_PORT_P13_SLAVE_RULE2 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP2_MEM_RULE0 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP2_MEM_RULE1 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE0 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE1 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE2 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE3 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE0 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE1 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE2 = 0x33333333U;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE3 = 0x33333333U;
    AHBSC->AHB_SECURE_CTRL_PERIPHERAL_RULE0 = 0x00003333U;

    /* Security level configuration of MBC checker */
    TRDC->MBC_INDEX[0].MBC_MEMN_GLBAC[0] = 0;
    TRDC->MBC_INDEX[0].MBC_MEMN_GLBAC[1] = 0x00004000U;
    TRDC->MBC_INDEX[0].MBC_MEMN_GLBAC[2] = 0x00006000U;
    TRDC->MBC_INDEX[0].MBC_MEMN_GLBAC[3] = 0x00006400U;
    TRDC->MBC_INDEX[0].MBC_MEMN_GLBAC[4] = 0x00006600U;
    TRDC->MBC_INDEX[0].MBC_MEMN_GLBAC[5] = 0x00006644U;
    TRDC->MBC_INDEX[0].MBC_MEMN_GLBAC[6] = 0x00006660U;
    TRDC->MBC_INDEX[0].MBC_MEMN_GLBAC[7] = 0x00006666U;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM0_BLK_CFG_W[0] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM0_BLK_CFG_W[1] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM0_BLK_CFG_W[2] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM0_BLK_CFG_W[3] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM0_BLK_CFG_W[4] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM0_BLK_CFG_W[5] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM0_BLK_CFG_W[6] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM0_BLK_CFG_W[7] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM1_BLK_CFG_W[0] = 0;
    TRDC->MBC_INDEX[0].MBC_DOM0_MEM2_BLK_CFG_W[0] = 0;

