ZigaMahne/NXP_FRDM-MCXN947_BSP/boards/frdmmcxn947/cmsis/templates/Board/DualCore_TZ/cm33_core0/secure/MCUXpressoConfig/trustzone/resource_config.c
    /* Security level configuration of masters */
    AHBSC->MASTER_SEC_LEVEL = 0x80000000U;
    AHBSC->MASTER_SEC_ANTI_POL_REG = 0xBFFFFFFFU;

    /*--------------------------------------------------------------------
     - Pins: Reading GPIO state
     -------------------------------------------------------------------*/
    /* Possible values for every pin:
     *  0b0    Deny
     *  0b1    Allow */
    AHBSC->SEC_GPIO_MASK[0] = 0;
    AHBSC->SEC_GPIO_MASK[1] = 0x3F000000U;

    /*--------------------------------------------------------------------
     - Pins: Access protection on IO pins and GPIO port IRQ/DMA requests
     -------------------------------------------------------------------*/
    /* Possible values for security control:
     * *-----------=----------=---------------------=---------------------*
     * | Bit-field |  Config  |   Security access   |  Privilege access   |
     * |   value   |  state   | control (PCNS/ICNS) | control (PCNP/ICNP) |
     * *-----------+----------+---------------------+---------------------*
     * |    0b00   |  S-Priv  |        Secure       |      Privilege      |
     * |    0b01   |  S-User  |        Secure       |    Non-Privilege    |
     * |    0b10   |  NS-Priv |      Non-Secure     |      Privilege      |
     * |    0b11   |  NS-User |      Non-Secure     |    Non-Privilege    |
     * *-----------=----------=---------------------=---------------------*
     * NOTE:
     * Pin Control Non-Secure (PCNS) & Non-Privilege (PCNP) configurable for every IO pin,
     * Interrupt Control Non-Secure (ICNS) & Non-Privilege (ICNP) for requests 0 a 1 only. */
    GPIO0->PCNS = 0;
    GPIO1->PCNS = 0;
    GPIO2->PCNS = 0;
    GPIO3->PCNS = 0;
    GPIO4->PCNS = 0;
    GPIO5->PCNS = 0;
    GPIO0->PCNP = 0;
    GPIO1->PCNP = 0;
    GPIO2->PCNP = 0;
    GPIO3->PCNP = 0;
    GPIO4->PCNP = 0;
    GPIO5->PCNP = 0;
    GPIO0->ICNS = 0;
    GPIO1->ICNS = 0;
    GPIO2->ICNS = 0;
    GPIO3->ICNS = 0;
    GPIO4->ICNS = 0;
    GPIO5->ICNS = 0;
    GPIO0->ICNP = 0;
    GPIO1->ICNP = 0;
    GPIO2->ICNP = 0;
    GPIO3->ICNP = 0;
    GPIO4->ICNP = 0;
    GPIO5->ICNP = 0;

    /*--------------------------------------------------------------------
     - Interrupts: Interrupt handling by Core1
     -------------------------------------------------------------------*/
    /* Possible values for every interrupt:
     *  0b0    Deny
     *  0b1    Allow */
    AHBSC->SEC_CPU1_INT_MASK0 = 0;
    AHBSC->SEC_CPU1_INT_MASK1 = 0x00020000U;
    AHBSC->SEC_CPU1_INT_MASK2 = 0x00000023U;
    AHBSC->SEC_CPU1_INT_MASK3 = 0;
    AHBSC->SEC_CPU1_INT_MASK4 = 0x00C00000U;

    /*--------------------------------------------------------------------
     - Interrupts: Interrupt security configuration
     -------------------------------------------------------------------*/
    /* Possible values for every interrupt:
     *  0b0    Secure
     *  0b1    Non-secure */
    NVIC->ITNS[0] = 0;
    NVIC->ITNS[1] = 0;
    NVIC->ITNS[2] = 0;
    NVIC->ITNS[3] = 0;
    NVIC->ITNS[4] = 0;

    /* Global Options */
    GPIO0->LOCK = 0;
    GPIO1->LOCK = 0;
    GPIO2->LOCK = 0;
    GPIO3->LOCK = 0;
    GPIO4->LOCK = 0;
    GPIO5->LOCK = 0;
    SCB->AIRCR = (SCB->AIRCR & 0x00009FF7U) | 0x05FA0000U;
    SCB->SCR &= 0xFFFFFFF7U;
    SCB->SHCSR &= 0xFFF7FFFFU;
    SCB->CPACR = 0;
    SCB->NSACR = 0x00000C03U;
    SCnSCB->CPPWR = 0;
    AHBSC->SEC_GP_REG_LOCK = 0xAAAAAAAAU;
    AHBSC->MASTER_SEC_LEVEL = (AHBSC->MASTER_SEC_LEVEL & 0x3FFFFFFFU) | 0x80000000U;
    AHBSC->MASTER_SEC_ANTI_POL_REG = (AHBSC->MASTER_SEC_ANTI_POL_REG & 0x3FFFFFFFU) | 0x80000000U;
    AHBSC->CPU0_LOCK_REG = 0x800002AAU;
    AHBSC->CPU1_LOCK_REG = 0x0000000AU;
    AHBSC->MISC_CTRL_REG = 0x000086A6U;
    AHBSC->MISC_CTRL_DP_REG = 0x000086A6U;
}

/***********************************************************************************************************************
 * BOARD_InitTEE function
 **********************************************************************************************************************/
void BOARD_InitTEE()
{
    BOARD_InitTrustZone();
    BOARD_InitAHBSE();
}

/***********************************************************************************************************************
 * BOARD_InitBootTEE function
 **********************************************************************************************************************/
void BOARD_InitBootTEE()
{
    BOARD_InitTEE();
}
